{
  "bedroom": [
    {
      "room_url": "https://img4.idealista.pt/blur/WEB_DETAIL/90/id.pro.pt.image.master/59/60/7c/290285934.jpg",
      "room_type": "bedroom",
      "size_m2": 12,
      "length_m2": 4,
      "width_m2": 3,
      "overall_condition": 2,
      "flooring_condition": 3,
      "ceiling_condition": 3,
      "painting_condition": 3,
      "windows_condition": 3,
      "doors_condition": 3,
      "plumbing_condition": null,
      "electrical_condition": 2,
      "appliances_condition": 2,
      "doors_number": 1,
      "windows_number": 1,
      "detailed_notes": "Room appears functional with good natural light from the window. Flooring is in good condition but may benefit from polishing. Walls and ceiling are generally well maintained, though painting is slightly outdated and could be refreshed. The single light bulb fixture suggests an update to lighting is needed for better ambiance and functionality. Window and door frames show no visible damage but could be checked for insulation improvement. Bedroom furniture and fixtures like lamps and mirrors are functional but somewhat old-fashioned; consider updating for modern style and better utility.",
      "image_description": "Bedroom"
    },
    {
      "room_url": "https://img4.idealista.pt/blur/WEB_DETAIL/90/id.pro.pt.image.master/a8/e9/9a/290285935.jpg",
      "room_type": "bedroom",
      "size_m2": 6,
      "length_m2": 3,
      "width_m2": 2,
      "overall_condition": 3,
      "flooring_condition": 3,
      "ceiling_condition": 4,
      "painting_condition": 3,
      "windows_condition": 3,
      "doors_condition": 3,
      "plumbing_condition": null,
      "electrical_condition": 3,
      "appliances_condition": 3,
      "doors_number": 1,
      "windows_number": 1,
      "detailed_notes": "Room is small and in generally good condition with a few signs of wear. Flooring is wooden and appears well-maintained but may benefit from refinishing. Walls and ceiling are painted white, with some potential minor touch-ups needed. Window has a curtain rod with a sheer curtain, windows seem functional but not new. Door is in usable condition but could be updated for modern aesthetics. Lighting fixture is basic and could be replaced with a more modern fixture for improved lighting and style. No visible electrical or plumbing issues. The room could be improved with some modern updates to enhance appeal.",
      "image_description": "Bedroom"
    },
    {
      "room_url": "https://img4.idealista.pt/blur/WEB_DETAIL/0/id.pro.pt.image.master/9f/bb/6f/290285964.jpg",
      "room_type": "bedroom",
      "size_m2": 9,
      "length_m2": 3,
      "width_m2": 3,
      "overall_condition": 3,
      "flooring_condition": 3,
      "ceiling_condition": 3,
      "painting_condition": 3,
      "windows_condition": 3,
      "doors_condition": 3,
      "plumbing_condition": null,
      "electrical_condition": 3,
      "appliances_condition": 3,
      "doors_number": 1,
      "windows_number": 1,
      "detailed_notes": "Room appears well maintained with older but good condition parquet flooring and paint. Paint on walls and ceiling looks intact with no visible stains or damage. The sliding closet doors and upper storage are functional but somewhat outdated. Window has a sheer curtain which filters light adequately; condition of window frame looks to be good from visible section. Door is intact with glass inserts, matching room style. Electrical outlets and lighting fixtures are present but not prominently visible, consider verifying their function. Overall, only minor updates or aesthetic improvements recommended.",
      "image_description": "Bedroom"
    },
    {
      "room_url": "https://img4.idealista.pt/blur/WEB_DETAIL/90/id.pro.pt.image.master/33/d5/d5/290286057.jpg",
      "room_type": "bedroom",
      "size_m2": 6,
      "length_m2": 3,
      "width_m2": 2,
      "overall_condition": 3,
      "flooring_condition": 3,
      "ceiling_condition": 4,
      "painting_condition": 4,
      "windows_condition": 0,
      "doors_condition": 3,
      "plumbing_condition": null,
      "electrical_condition": 3,
      "appliances_condition": 2,
      "doors_number": 1,
      "windows_number": 0,
      "detailed_notes": "Room appears to be a small bedroom with built-in wooden wardrobes and a wooden floor covered by a carpet. Walls and ceiling are freshly painted and in good condition. The single door looks in good condition. No windows visible in the image; may limit natural light and ventilation, which is a potential concern. Electrical outlets and lighting appear to be standard and functional. Wooden wardrobes seem old with some wear; may need refurbishing or replacement depending on use. Overall minor updates recommended, especially to improve natural lighting or adding windows if possible.",
      "image_description": "Bedroom"
    }
  ],
  "bathroom": [
    {
      "room_url": "https://img4.idealista.pt/blur/WEB_DETAIL/90/id.pro.pt.image.master/ce/fa/36/290286079.jpg",
      "room_type": "bathroom",
      "size_m2": 3.6,
      "length_m2": 2.4,
      "width_m2": 1.5,
      "overall_condition": 2,
      "flooring_condition": 2,
      "ceiling_condition": 3,
      "painting_condition": 3,
      "windows_condition": 3,
      "doors_condition": 3,
      "plumbing_condition": 2,
      "electrical_condition": 3,
      "appliances_condition": 2,
      "doors_number": 1,
      "windows_number": 1,
      "detailed_notes": "Bathroom appears somewhat outdated but functional. Flooring is old terrazzo-style which shows wear and may require replacement for modern standards. Bathtub, toilet, and sink are older models, working but could be replaced or refurbished. Plumbing fixtures appear original and may need upgrading soon. Walls, ceiling, and paint look clean but dated. Window provides natural light and is in good condition. Light fixtures above mirror and ceiling lights are operational but basic. Door and frame look intact with minor wear.",
      "image_description": "Bathroom"
    }
  ],
  "kitchen": [
    {
      "room_url": "https://img4.idealista.pt/blur/WEB_DETAIL/0/id.pro.pt.image.master/da/64/3a/290285981.jpg",
      "room_type": "kitchen",
      "size_m2": 5,
      "length_m2": 2.5,
      "width_m2": 2,
      "overall_condition": 2,
      "flooring_condition": 2,
      "ceiling_condition": 3,
      "painting_condition": 3,
      "windows_condition": 3,
      "doors_condition": 3,
      "plumbing_condition": 3,
      "electrical_condition": 2,
      "appliances_condition": 1,
      "doors_number": 1,
      "windows_number": 1,
      "detailed_notes": "Small kitchen with dated wooden cabinetry and countertops; refrigerator door open and older style stove suggests appliance replacements are needed. Floor shows wear and may benefit from updating. Ceiling and walls are in reasonable condition but repainting could refresh the space. Electrical outlets visible but may need updating. Window frame appears solid but the glass is frosted, limiting natural light. Plumbing fixtures (sink/faucet) appear functional but old. Suggest kitchen remodel focused on replacing cabinets, appliances, improving lighting, and updating floor for modernization.",
      "image_description": "Kitchen"
    }
  ],
  "living_room": [
    {
      "room_url": "https://img4.idealista.pt/blur/WEB_DETAIL/90/id.pro.pt.image.master/c5/2f/b1/290286078.jpg",
      "room_type": "living_room",
      "size_m2": 12,
      "length_m2": 4,
      "width_m2": 3,
      "overall_condition": 3,
      "flooring_condition": 3,
      "ceiling_condition": 3,
      "painting_condition": 3,
      "windows_condition": 3,
      "doors_condition": 3,
      "plumbing_condition": null,
      "electrical_condition": 3,
      "appliances_condition": 2,
      "doors_number": 1,
      "windows_number": 1,
      "detailed_notes": "Room is generally in good condition with no visible damage. Floors are clean but appear somewhat dated and could be updated for a modern look. Walls and paint are clean but may benefit from a fresh coat. Window and door frames appear functional but not new. Electrical fixtures including ceiling chandelier are older style but operational. Furniture is used and simple, built-in wardrobes are not visible and lighting fixtures could be improved. Recommend minor renovations focused on style updates rather than repairs.",
      "image_description": "Living room"
    }
  ]
}